###############################################################################
# Created by write_sdc
###############################################################################
current_design top
###############################################################################
# Timing Constraints
###############################################################################

set ::env(SYNTH_CLOCK_UNCERTAINTY) 0.25
set ::env(SYNTH_CLOCK_TRANSITION) 0.15
set ::env(SYNTH_TIMING_DERATE) 0.05
set ::env(CLOCK_BUFFER_FANOUT) 16
set ::env(IO_PCT) 0.2
set ::env(MAX_TRANSITION_CONSTRAINT) 0.75
set ::env(MAX_FANOUT_CONSTRAINT) 10
set ::env(OUTPUT_CAP_LOAD) 33.4
set ::env(MAX_CAP) 0.2
set ::env(CLOCK_PERIOD) $env(CLOCK_PERIOD)

set input_delay_value [expr $::env(CLOCK_PERIOD) * $::env(IO_PCT)]
set output_delay_value [expr $::env(CLOCK_PERIOD) * $::env(IO_PCT)]
set cap_load [expr $::env(OUTPUT_CAP_LOAD) / 1000.0]

create_clock -name clk -period $::env(CLOCK_PERIOD) [get_ports {clk}]

set_clock_transition $::env(SYNTH_CLOCK_TRANSITION) [get_clocks {clk}]
set_clock_uncertainty $::env(SYNTH_CLOCK_UNCERTAINTY) clk
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HRDATA[0]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HRDATA[10]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HRDATA[11]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HRDATA[12]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HRDATA[13]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HRDATA[14]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HRDATA[15]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HRDATA[16]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HRDATA[17]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HRDATA[18]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HRDATA[19]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HRDATA[1]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HRDATA[20]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HRDATA[21]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HRDATA[22]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HRDATA[23]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HRDATA[24]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HRDATA[25]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HRDATA[26]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HRDATA[27]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HRDATA[28]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HRDATA[29]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HRDATA[2]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HRDATA[30]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HRDATA[31]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HRDATA[3]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HRDATA[4]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HRDATA[5]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HRDATA[6]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HRDATA[7]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HRDATA[8]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HRDATA[9]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HREADY}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HRESP}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {debugReset}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {debug_bus_cmd_payload_address[0]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {debug_bus_cmd_payload_address[1]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {debug_bus_cmd_payload_address[2]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {debug_bus_cmd_payload_address[3]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {debug_bus_cmd_payload_address[4]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {debug_bus_cmd_payload_address[5]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {debug_bus_cmd_payload_address[6]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {debug_bus_cmd_payload_address[7]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {debug_bus_cmd_payload_data[0]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {debug_bus_cmd_payload_data[10]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {debug_bus_cmd_payload_data[11]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {debug_bus_cmd_payload_data[12]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {debug_bus_cmd_payload_data[13]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {debug_bus_cmd_payload_data[14]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {debug_bus_cmd_payload_data[15]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {debug_bus_cmd_payload_data[16]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {debug_bus_cmd_payload_data[17]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {debug_bus_cmd_payload_data[18]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {debug_bus_cmd_payload_data[19]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {debug_bus_cmd_payload_data[1]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {debug_bus_cmd_payload_data[20]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {debug_bus_cmd_payload_data[21]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {debug_bus_cmd_payload_data[22]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {debug_bus_cmd_payload_data[23]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {debug_bus_cmd_payload_data[24]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {debug_bus_cmd_payload_data[25]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {debug_bus_cmd_payload_data[26]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {debug_bus_cmd_payload_data[27]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {debug_bus_cmd_payload_data[28]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {debug_bus_cmd_payload_data[29]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {debug_bus_cmd_payload_data[2]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {debug_bus_cmd_payload_data[30]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {debug_bus_cmd_payload_data[31]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {debug_bus_cmd_payload_data[3]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {debug_bus_cmd_payload_data[4]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {debug_bus_cmd_payload_data[5]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {debug_bus_cmd_payload_data[6]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {debug_bus_cmd_payload_data[7]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {debug_bus_cmd_payload_data[8]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {debug_bus_cmd_payload_data[9]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {debug_bus_cmd_payload_wr}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {debug_bus_cmd_valid}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {externalInterrupt}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HRDATA[0]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HRDATA[10]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HRDATA[11]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HRDATA[12]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HRDATA[13]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HRDATA[14]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HRDATA[15]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HRDATA[16]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HRDATA[17]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HRDATA[18]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HRDATA[19]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HRDATA[1]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HRDATA[20]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HRDATA[21]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HRDATA[22]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HRDATA[23]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HRDATA[24]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HRDATA[25]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HRDATA[26]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HRDATA[27]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HRDATA[28]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HRDATA[29]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HRDATA[2]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HRDATA[30]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HRDATA[31]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HRDATA[3]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HRDATA[4]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HRDATA[5]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HRDATA[6]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HRDATA[7]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HRDATA[8]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HRDATA[9]}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HREADY}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HRESP}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {rst}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {softwareInterrupt}]
set_input_delay $input_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {timerInterrupt}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HADDR[0]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HADDR[10]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HADDR[11]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HADDR[12]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HADDR[13]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HADDR[14]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HADDR[15]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HADDR[16]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HADDR[17]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HADDR[18]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HADDR[19]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HADDR[1]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HADDR[20]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HADDR[21]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HADDR[22]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HADDR[23]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HADDR[24]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HADDR[25]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HADDR[26]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HADDR[27]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HADDR[28]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HADDR[29]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HADDR[2]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HADDR[30]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HADDR[31]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HADDR[3]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HADDR[4]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HADDR[5]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HADDR[6]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HADDR[7]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HADDR[8]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HADDR[9]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HBURST[0]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HBURST[1]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HBURST[2]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HMASTLOCK}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HPROT[0]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HPROT[1]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HPROT[2]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HPROT[3]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HSIZE[0]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HSIZE[1]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HSIZE[2]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HTRANS[0]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HTRANS[1]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HWDATA[0]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HWDATA[10]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HWDATA[11]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HWDATA[12]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HWDATA[13]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HWDATA[14]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HWDATA[15]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HWDATA[16]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HWDATA[17]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HWDATA[18]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HWDATA[19]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HWDATA[1]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HWDATA[20]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HWDATA[21]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HWDATA[22]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HWDATA[23]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HWDATA[24]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HWDATA[25]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HWDATA[26]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HWDATA[27]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HWDATA[28]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HWDATA[29]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HWDATA[2]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HWDATA[30]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HWDATA[31]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HWDATA[3]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HWDATA[4]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HWDATA[5]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HWDATA[6]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HWDATA[7]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HWDATA[8]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HWDATA[9]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {dBusAhbLite3_HWRITE}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {debug_bus_cmd_ready}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {debug_bus_rsp_data[0]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {debug_bus_rsp_data[10]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {debug_bus_rsp_data[11]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {debug_bus_rsp_data[12]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {debug_bus_rsp_data[13]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {debug_bus_rsp_data[14]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {debug_bus_rsp_data[15]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {debug_bus_rsp_data[16]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {debug_bus_rsp_data[17]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {debug_bus_rsp_data[18]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {debug_bus_rsp_data[19]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {debug_bus_rsp_data[1]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {debug_bus_rsp_data[20]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {debug_bus_rsp_data[21]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {debug_bus_rsp_data[22]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {debug_bus_rsp_data[23]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {debug_bus_rsp_data[24]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {debug_bus_rsp_data[25]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {debug_bus_rsp_data[26]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {debug_bus_rsp_data[27]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {debug_bus_rsp_data[28]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {debug_bus_rsp_data[29]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {debug_bus_rsp_data[2]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {debug_bus_rsp_data[30]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {debug_bus_rsp_data[31]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {debug_bus_rsp_data[3]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {debug_bus_rsp_data[4]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {debug_bus_rsp_data[5]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {debug_bus_rsp_data[6]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {debug_bus_rsp_data[7]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {debug_bus_rsp_data[8]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {debug_bus_rsp_data[9]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {debug_resetOut}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HADDR[0]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HADDR[10]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HADDR[11]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HADDR[12]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HADDR[13]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HADDR[14]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HADDR[15]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HADDR[16]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HADDR[17]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HADDR[18]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HADDR[19]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HADDR[1]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HADDR[20]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HADDR[21]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HADDR[22]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HADDR[23]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HADDR[24]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HADDR[25]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HADDR[26]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HADDR[27]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HADDR[28]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HADDR[29]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HADDR[2]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HADDR[30]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HADDR[31]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HADDR[3]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HADDR[4]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HADDR[5]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HADDR[6]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HADDR[7]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HADDR[8]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HADDR[9]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HBURST[0]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HBURST[1]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HBURST[2]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HMASTLOCK}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HPROT[0]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HPROT[1]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HPROT[2]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HPROT[3]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HSIZE[0]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HSIZE[1]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HSIZE[2]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HTRANS[0]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HTRANS[1]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HWDATA[0]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HWDATA[10]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HWDATA[11]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HWDATA[12]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HWDATA[13]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HWDATA[14]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HWDATA[15]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HWDATA[16]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HWDATA[17]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HWDATA[18]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HWDATA[19]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HWDATA[1]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HWDATA[20]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HWDATA[21]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HWDATA[22]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HWDATA[23]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HWDATA[24]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HWDATA[25]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HWDATA[26]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HWDATA[27]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HWDATA[28]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HWDATA[29]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HWDATA[2]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HWDATA[30]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HWDATA[31]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HWDATA[3]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HWDATA[4]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HWDATA[5]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HWDATA[6]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HWDATA[7]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HWDATA[8]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HWDATA[9]}]
set_output_delay $output_delay_value -clock [get_clocks {clk}] -add_delay [get_ports {iBusAhbLite3_HWRITE}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load $cap_load [get_ports {dBusAhbLite3_HMASTLOCK}]
set_load -pin_load $cap_load [get_ports {dBusAhbLite3_HWRITE}]
set_load -pin_load $cap_load [get_ports {debug_bus_cmd_ready}]
set_load -pin_load $cap_load [get_ports {debug_resetOut}]
set_load -pin_load $cap_load [get_ports {iBusAhbLite3_HMASTLOCK}]
set_load -pin_load $cap_load [get_ports {iBusAhbLite3_HWRITE}]
set_load -pin_load $cap_load [get_ports {dBusAhbLite3_HADDR[31]}]
set_load -pin_load $cap_load [get_ports {dBusAhbLite3_HADDR[30]}]
set_load -pin_load $cap_load [get_ports {dBusAhbLite3_HADDR[29]}]
set_load -pin_load $cap_load [get_ports {dBusAhbLite3_HADDR[28]}]
set_load -pin_load $cap_load [get_ports {dBusAhbLite3_HADDR[27]}]
set_load -pin_load $cap_load [get_ports {dBusAhbLite3_HADDR[26]}]
set_load -pin_load $cap_load [get_ports {dBusAhbLite3_HADDR[25]}]
set_load -pin_load $cap_load [get_ports {dBusAhbLite3_HADDR[24]}]
set_load -pin_load $cap_load [get_ports {dBusAhbLite3_HADDR[23]}]
set_load -pin_load $cap_load [get_ports {dBusAhbLite3_HADDR[22]}]
set_load -pin_load $cap_load [get_ports {dBusAhbLite3_HADDR[21]}]
set_load -pin_load $cap_load [get_ports {dBusAhbLite3_HADDR[20]}]
set_load -pin_load $cap_load [get_ports {dBusAhbLite3_HADDR[19]}]
set_load -pin_load $cap_load [get_ports {dBusAhbLite3_HADDR[18]}]
set_load -pin_load $cap_load [get_ports {dBusAhbLite3_HADDR[17]}]
set_load -pin_load $cap_load [get_ports {dBusAhbLite3_HADDR[16]}]
set_load -pin_load $cap_load [get_ports {dBusAhbLite3_HADDR[15]}]
set_load -pin_load $cap_load [get_ports {dBusAhbLite3_HADDR[14]}]
set_load -pin_load $cap_load [get_ports {dBusAhbLite3_HADDR[13]}]
set_load -pin_load $cap_load [get_ports {dBusAhbLite3_HADDR[12]}]
set_load -pin_load $cap_load [get_ports {dBusAhbLite3_HADDR[11]}]
set_load -pin_load $cap_load [get_ports {dBusAhbLite3_HADDR[10]}]
set_load -pin_load $cap_load [get_ports {dBusAhbLite3_HADDR[9]}]
set_load -pin_load $cap_load [get_ports {dBusAhbLite3_HADDR[8]}]
set_load -pin_load $cap_load [get_ports {dBusAhbLite3_HADDR[7]}]
set_load -pin_load $cap_load [get_ports {dBusAhbLite3_HADDR[6]}]
set_load -pin_load $cap_load [get_ports {dBusAhbLite3_HADDR[5]}]
set_load -pin_load $cap_load [get_ports {dBusAhbLite3_HADDR[4]}]
set_load -pin_load $cap_load [get_ports {dBusAhbLite3_HADDR[3]}]
set_load -pin_load $cap_load [get_ports {dBusAhbLite3_HADDR[2]}]
set_load -pin_load $cap_load [get_ports {dBusAhbLite3_HADDR[1]}]
set_load -pin_load $cap_load [get_ports {dBusAhbLite3_HADDR[0]}]
set_load -pin_load $cap_load [get_ports {dBusAhbLite3_HBURST[2]}]
set_load -pin_load $cap_load [get_ports {dBusAhbLite3_HBURST[1]}]
set_load -pin_load $cap_load [get_ports {dBusAhbLite3_HBURST[0]}]
set_load -pin_load $cap_load [get_ports {dBusAhbLite3_HPROT[3]}]
set_load -pin_load $cap_load [get_ports {dBusAhbLite3_HPROT[2]}]
set_load -pin_load $cap_load [get_ports {dBusAhbLite3_HPROT[1]}]
set_load -pin_load $cap_load [get_ports {dBusAhbLite3_HPROT[0]}]
set_load -pin_load $cap_load [get_ports {dBusAhbLite3_HSIZE[2]}]
set_load -pin_load $cap_load [get_ports {dBusAhbLite3_HSIZE[1]}]
set_load -pin_load $cap_load [get_ports {dBusAhbLite3_HSIZE[0]}]
set_load -pin_load $cap_load [get_ports {dBusAhbLite3_HTRANS[1]}]
set_load -pin_load $cap_load [get_ports {dBusAhbLite3_HTRANS[0]}]
set_load -pin_load $cap_load [get_ports {dBusAhbLite3_HWDATA[31]}]
set_load -pin_load $cap_load [get_ports {dBusAhbLite3_HWDATA[30]}]
set_load -pin_load $cap_load [get_ports {dBusAhbLite3_HWDATA[29]}]
set_load -pin_load $cap_load [get_ports {dBusAhbLite3_HWDATA[28]}]
set_load -pin_load $cap_load [get_ports {dBusAhbLite3_HWDATA[27]}]
set_load -pin_load $cap_load [get_ports {dBusAhbLite3_HWDATA[26]}]
set_load -pin_load $cap_load [get_ports {dBusAhbLite3_HWDATA[25]}]
set_load -pin_load $cap_load [get_ports {dBusAhbLite3_HWDATA[24]}]
set_load -pin_load $cap_load [get_ports {dBusAhbLite3_HWDATA[23]}]
set_load -pin_load $cap_load [get_ports {dBusAhbLite3_HWDATA[22]}]
set_load -pin_load $cap_load [get_ports {dBusAhbLite3_HWDATA[21]}]
set_load -pin_load $cap_load [get_ports {dBusAhbLite3_HWDATA[20]}]
set_load -pin_load $cap_load [get_ports {dBusAhbLite3_HWDATA[19]}]
set_load -pin_load $cap_load [get_ports {dBusAhbLite3_HWDATA[18]}]
set_load -pin_load $cap_load [get_ports {dBusAhbLite3_HWDATA[17]}]
set_load -pin_load $cap_load [get_ports {dBusAhbLite3_HWDATA[16]}]
set_load -pin_load $cap_load [get_ports {dBusAhbLite3_HWDATA[15]}]
set_load -pin_load $cap_load [get_ports {dBusAhbLite3_HWDATA[14]}]
set_load -pin_load $cap_load [get_ports {dBusAhbLite3_HWDATA[13]}]
set_load -pin_load $cap_load [get_ports {dBusAhbLite3_HWDATA[12]}]
set_load -pin_load $cap_load [get_ports {dBusAhbLite3_HWDATA[11]}]
set_load -pin_load $cap_load [get_ports {dBusAhbLite3_HWDATA[10]}]
set_load -pin_load $cap_load [get_ports {dBusAhbLite3_HWDATA[9]}]
set_load -pin_load $cap_load [get_ports {dBusAhbLite3_HWDATA[8]}]
set_load -pin_load $cap_load [get_ports {dBusAhbLite3_HWDATA[7]}]
set_load -pin_load $cap_load [get_ports {dBusAhbLite3_HWDATA[6]}]
set_load -pin_load $cap_load [get_ports {dBusAhbLite3_HWDATA[5]}]
set_load -pin_load $cap_load [get_ports {dBusAhbLite3_HWDATA[4]}]
set_load -pin_load $cap_load [get_ports {dBusAhbLite3_HWDATA[3]}]
set_load -pin_load $cap_load [get_ports {dBusAhbLite3_HWDATA[2]}]
set_load -pin_load $cap_load [get_ports {dBusAhbLite3_HWDATA[1]}]
set_load -pin_load $cap_load [get_ports {dBusAhbLite3_HWDATA[0]}]
set_load -pin_load $cap_load [get_ports {debug_bus_rsp_data[31]}]
set_load -pin_load $cap_load [get_ports {debug_bus_rsp_data[30]}]
set_load -pin_load $cap_load [get_ports {debug_bus_rsp_data[29]}]
set_load -pin_load $cap_load [get_ports {debug_bus_rsp_data[28]}]
set_load -pin_load $cap_load [get_ports {debug_bus_rsp_data[27]}]
set_load -pin_load $cap_load [get_ports {debug_bus_rsp_data[26]}]
set_load -pin_load $cap_load [get_ports {debug_bus_rsp_data[25]}]
set_load -pin_load $cap_load [get_ports {debug_bus_rsp_data[24]}]
set_load -pin_load $cap_load [get_ports {debug_bus_rsp_data[23]}]
set_load -pin_load $cap_load [get_ports {debug_bus_rsp_data[22]}]
set_load -pin_load $cap_load [get_ports {debug_bus_rsp_data[21]}]
set_load -pin_load $cap_load [get_ports {debug_bus_rsp_data[20]}]
set_load -pin_load $cap_load [get_ports {debug_bus_rsp_data[19]}]
set_load -pin_load $cap_load [get_ports {debug_bus_rsp_data[18]}]
set_load -pin_load $cap_load [get_ports {debug_bus_rsp_data[17]}]
set_load -pin_load $cap_load [get_ports {debug_bus_rsp_data[16]}]
set_load -pin_load $cap_load [get_ports {debug_bus_rsp_data[15]}]
set_load -pin_load $cap_load [get_ports {debug_bus_rsp_data[14]}]
set_load -pin_load $cap_load [get_ports {debug_bus_rsp_data[13]}]
set_load -pin_load $cap_load [get_ports {debug_bus_rsp_data[12]}]
set_load -pin_load $cap_load [get_ports {debug_bus_rsp_data[11]}]
set_load -pin_load $cap_load [get_ports {debug_bus_rsp_data[10]}]
set_load -pin_load $cap_load [get_ports {debug_bus_rsp_data[9]}]
set_load -pin_load $cap_load [get_ports {debug_bus_rsp_data[8]}]
set_load -pin_load $cap_load [get_ports {debug_bus_rsp_data[7]}]
set_load -pin_load $cap_load [get_ports {debug_bus_rsp_data[6]}]
set_load -pin_load $cap_load [get_ports {debug_bus_rsp_data[5]}]
set_load -pin_load $cap_load [get_ports {debug_bus_rsp_data[4]}]
set_load -pin_load $cap_load [get_ports {debug_bus_rsp_data[3]}]
set_load -pin_load $cap_load [get_ports {debug_bus_rsp_data[2]}]
set_load -pin_load $cap_load [get_ports {debug_bus_rsp_data[1]}]
set_load -pin_load $cap_load [get_ports {debug_bus_rsp_data[0]}]
set_load -pin_load $cap_load [get_ports {iBusAhbLite3_HADDR[31]}]
set_load -pin_load $cap_load [get_ports {iBusAhbLite3_HADDR[30]}]
set_load -pin_load $cap_load [get_ports {iBusAhbLite3_HADDR[29]}]
set_load -pin_load $cap_load [get_ports {iBusAhbLite3_HADDR[28]}]
set_load -pin_load $cap_load [get_ports {iBusAhbLite3_HADDR[27]}]
set_load -pin_load $cap_load [get_ports {iBusAhbLite3_HADDR[26]}]
set_load -pin_load $cap_load [get_ports {iBusAhbLite3_HADDR[25]}]
set_load -pin_load $cap_load [get_ports {iBusAhbLite3_HADDR[24]}]
set_load -pin_load $cap_load [get_ports {iBusAhbLite3_HADDR[23]}]
set_load -pin_load $cap_load [get_ports {iBusAhbLite3_HADDR[22]}]
set_load -pin_load $cap_load [get_ports {iBusAhbLite3_HADDR[21]}]
set_load -pin_load $cap_load [get_ports {iBusAhbLite3_HADDR[20]}]
set_load -pin_load $cap_load [get_ports {iBusAhbLite3_HADDR[19]}]
set_load -pin_load $cap_load [get_ports {iBusAhbLite3_HADDR[18]}]
set_load -pin_load $cap_load [get_ports {iBusAhbLite3_HADDR[17]}]
set_load -pin_load $cap_load [get_ports {iBusAhbLite3_HADDR[16]}]
set_load -pin_load $cap_load [get_ports {iBusAhbLite3_HADDR[15]}]
set_load -pin_load $cap_load [get_ports {iBusAhbLite3_HADDR[14]}]
set_load -pin_load $cap_load [get_ports {iBusAhbLite3_HADDR[13]}]
set_load -pin_load $cap_load [get_ports {iBusAhbLite3_HADDR[12]}]
set_load -pin_load $cap_load [get_ports {iBusAhbLite3_HADDR[11]}]
set_load -pin_load $cap_load [get_ports {iBusAhbLite3_HADDR[10]}]
set_load -pin_load $cap_load [get_ports {iBusAhbLite3_HADDR[9]}]
set_load -pin_load $cap_load [get_ports {iBusAhbLite3_HADDR[8]}]
set_load -pin_load $cap_load [get_ports {iBusAhbLite3_HADDR[7]}]
set_load -pin_load $cap_load [get_ports {iBusAhbLite3_HADDR[6]}]
set_load -pin_load $cap_load [get_ports {iBusAhbLite3_HADDR[5]}]
set_load -pin_load $cap_load [get_ports {iBusAhbLite3_HADDR[4]}]
set_load -pin_load $cap_load [get_ports {iBusAhbLite3_HADDR[3]}]
set_load -pin_load $cap_load [get_ports {iBusAhbLite3_HADDR[2]}]
set_load -pin_load $cap_load [get_ports {iBusAhbLite3_HADDR[1]}]
set_load -pin_load $cap_load [get_ports {iBusAhbLite3_HADDR[0]}]
set_load -pin_load $cap_load [get_ports {iBusAhbLite3_HBURST[2]}]
set_load -pin_load $cap_load [get_ports {iBusAhbLite3_HBURST[1]}]
set_load -pin_load $cap_load [get_ports {iBusAhbLite3_HBURST[0]}]
set_load -pin_load $cap_load [get_ports {iBusAhbLite3_HPROT[3]}]
set_load -pin_load $cap_load [get_ports {iBusAhbLite3_HPROT[2]}]
set_load -pin_load $cap_load [get_ports {iBusAhbLite3_HPROT[1]}]
set_load -pin_load $cap_load [get_ports {iBusAhbLite3_HPROT[0]}]
set_load -pin_load $cap_load [get_ports {iBusAhbLite3_HSIZE[2]}]
set_load -pin_load $cap_load [get_ports {iBusAhbLite3_HSIZE[1]}]
set_load -pin_load $cap_load [get_ports {iBusAhbLite3_HSIZE[0]}]
set_load -pin_load $cap_load [get_ports {iBusAhbLite3_HTRANS[1]}]
set_load -pin_load $cap_load [get_ports {iBusAhbLite3_HTRANS[0]}]
set_load -pin_load $cap_load [get_ports {iBusAhbLite3_HWDATA[31]}]
set_load -pin_load $cap_load [get_ports {iBusAhbLite3_HWDATA[30]}]
set_load -pin_load $cap_load [get_ports {iBusAhbLite3_HWDATA[29]}]
set_load -pin_load $cap_load [get_ports {iBusAhbLite3_HWDATA[28]}]
set_load -pin_load $cap_load [get_ports {iBusAhbLite3_HWDATA[27]}]
set_load -pin_load $cap_load [get_ports {iBusAhbLite3_HWDATA[26]}]
set_load -pin_load $cap_load [get_ports {iBusAhbLite3_HWDATA[25]}]
set_load -pin_load $cap_load [get_ports {iBusAhbLite3_HWDATA[24]}]
set_load -pin_load $cap_load [get_ports {iBusAhbLite3_HWDATA[23]}]
set_load -pin_load $cap_load [get_ports {iBusAhbLite3_HWDATA[22]}]
set_load -pin_load $cap_load [get_ports {iBusAhbLite3_HWDATA[21]}]
set_load -pin_load $cap_load [get_ports {iBusAhbLite3_HWDATA[20]}]
set_load -pin_load $cap_load [get_ports {iBusAhbLite3_HWDATA[19]}]
set_load -pin_load $cap_load [get_ports {iBusAhbLite3_HWDATA[18]}]
set_load -pin_load $cap_load [get_ports {iBusAhbLite3_HWDATA[17]}]
set_load -pin_load $cap_load [get_ports {iBusAhbLite3_HWDATA[16]}]
set_load -pin_load $cap_load [get_ports {iBusAhbLite3_HWDATA[15]}]
set_load -pin_load $cap_load [get_ports {iBusAhbLite3_HWDATA[14]}]
set_load -pin_load $cap_load [get_ports {iBusAhbLite3_HWDATA[13]}]
set_load -pin_load $cap_load [get_ports {iBusAhbLite3_HWDATA[12]}]
set_load -pin_load $cap_load [get_ports {iBusAhbLite3_HWDATA[11]}]
set_load -pin_load $cap_load [get_ports {iBusAhbLite3_HWDATA[10]}]
set_load -pin_load $cap_load [get_ports {iBusAhbLite3_HWDATA[9]}]
set_load -pin_load $cap_load [get_ports {iBusAhbLite3_HWDATA[8]}]
set_load -pin_load $cap_load [get_ports {iBusAhbLite3_HWDATA[7]}]
set_load -pin_load $cap_load [get_ports {iBusAhbLite3_HWDATA[6]}]
set_load -pin_load $cap_load [get_ports {iBusAhbLite3_HWDATA[5]}]
set_load -pin_load $cap_load [get_ports {iBusAhbLite3_HWDATA[4]}]
set_load -pin_load $cap_load [get_ports {iBusAhbLite3_HWDATA[3]}]
set_load -pin_load $cap_load [get_ports {iBusAhbLite3_HWDATA[2]}]
set_load -pin_load $cap_load [get_ports {iBusAhbLite3_HWDATA[1]}]
set_load -pin_load $cap_load [get_ports {iBusAhbLite3_HWDATA[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dBusAhbLite3_HREADY}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dBusAhbLite3_HRESP}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {debugReset}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {debug_bus_cmd_payload_wr}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {debug_bus_cmd_valid}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {externalInterrupt}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {iBusAhbLite3_HREADY}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {iBusAhbLite3_HRESP}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rst}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {softwareInterrupt}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {timerInterrupt}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dBusAhbLite3_HRDATA[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dBusAhbLite3_HRDATA[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dBusAhbLite3_HRDATA[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dBusAhbLite3_HRDATA[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dBusAhbLite3_HRDATA[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dBusAhbLite3_HRDATA[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dBusAhbLite3_HRDATA[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dBusAhbLite3_HRDATA[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dBusAhbLite3_HRDATA[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dBusAhbLite3_HRDATA[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dBusAhbLite3_HRDATA[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dBusAhbLite3_HRDATA[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dBusAhbLite3_HRDATA[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dBusAhbLite3_HRDATA[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dBusAhbLite3_HRDATA[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dBusAhbLite3_HRDATA[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dBusAhbLite3_HRDATA[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dBusAhbLite3_HRDATA[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dBusAhbLite3_HRDATA[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dBusAhbLite3_HRDATA[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dBusAhbLite3_HRDATA[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dBusAhbLite3_HRDATA[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dBusAhbLite3_HRDATA[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dBusAhbLite3_HRDATA[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dBusAhbLite3_HRDATA[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dBusAhbLite3_HRDATA[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dBusAhbLite3_HRDATA[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dBusAhbLite3_HRDATA[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dBusAhbLite3_HRDATA[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dBusAhbLite3_HRDATA[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dBusAhbLite3_HRDATA[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dBusAhbLite3_HRDATA[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {debug_bus_cmd_payload_address[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {debug_bus_cmd_payload_address[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {debug_bus_cmd_payload_address[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {debug_bus_cmd_payload_address[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {debug_bus_cmd_payload_address[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {debug_bus_cmd_payload_address[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {debug_bus_cmd_payload_address[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {debug_bus_cmd_payload_address[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {debug_bus_cmd_payload_data[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {debug_bus_cmd_payload_data[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {debug_bus_cmd_payload_data[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {debug_bus_cmd_payload_data[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {debug_bus_cmd_payload_data[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {debug_bus_cmd_payload_data[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {debug_bus_cmd_payload_data[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {debug_bus_cmd_payload_data[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {debug_bus_cmd_payload_data[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {debug_bus_cmd_payload_data[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {debug_bus_cmd_payload_data[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {debug_bus_cmd_payload_data[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {debug_bus_cmd_payload_data[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {debug_bus_cmd_payload_data[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {debug_bus_cmd_payload_data[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {debug_bus_cmd_payload_data[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {debug_bus_cmd_payload_data[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {debug_bus_cmd_payload_data[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {debug_bus_cmd_payload_data[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {debug_bus_cmd_payload_data[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {debug_bus_cmd_payload_data[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {debug_bus_cmd_payload_data[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {debug_bus_cmd_payload_data[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {debug_bus_cmd_payload_data[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {debug_bus_cmd_payload_data[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {debug_bus_cmd_payload_data[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {debug_bus_cmd_payload_data[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {debug_bus_cmd_payload_data[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {debug_bus_cmd_payload_data[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {debug_bus_cmd_payload_data[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {debug_bus_cmd_payload_data[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {debug_bus_cmd_payload_data[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {iBusAhbLite3_HRDATA[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {iBusAhbLite3_HRDATA[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {iBusAhbLite3_HRDATA[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {iBusAhbLite3_HRDATA[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {iBusAhbLite3_HRDATA[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {iBusAhbLite3_HRDATA[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {iBusAhbLite3_HRDATA[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {iBusAhbLite3_HRDATA[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {iBusAhbLite3_HRDATA[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {iBusAhbLite3_HRDATA[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {iBusAhbLite3_HRDATA[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {iBusAhbLite3_HRDATA[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {iBusAhbLite3_HRDATA[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {iBusAhbLite3_HRDATA[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {iBusAhbLite3_HRDATA[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {iBusAhbLite3_HRDATA[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {iBusAhbLite3_HRDATA[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {iBusAhbLite3_HRDATA[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {iBusAhbLite3_HRDATA[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {iBusAhbLite3_HRDATA[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {iBusAhbLite3_HRDATA[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {iBusAhbLite3_HRDATA[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {iBusAhbLite3_HRDATA[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {iBusAhbLite3_HRDATA[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {iBusAhbLite3_HRDATA[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {iBusAhbLite3_HRDATA[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {iBusAhbLite3_HRDATA[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {iBusAhbLite3_HRDATA[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {iBusAhbLite3_HRDATA[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {iBusAhbLite3_HRDATA[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {iBusAhbLite3_HRDATA[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {iBusAhbLite3_HRDATA[0]}]
###############################################################################
# Design Rules
###############################################################################
set_max_transition $::env(MAX_TRANSITION_CONSTRAINT) [current_design]
set_max_capacitance $::env(MAX_CAP) [current_design]
set_max_fanout $::env(MAX_FANOUT_CONSTRAINT) [current_design]
